Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: The string passed as text may begin with a plus or minus sign character (+ or -), followed by one or more numeric digits (0-9) or letters (a-z or A-Z).
ja: textとして渡される文字列は、プラスまたはマイナス符号文字（+または-）で始まり、１つ以上の数値のアラビア数字（0-9）または文字（a-z or A-Z）が続くことがあります。

source: The string to print after all items have been printed.
ja: すべての項目が出力された後に出力する文字列。

source: The string to print.
ja: 出力するメッセージ

source: The string to use in a named collection (e.g. a string-keyed dictionary).
ja: 文字列を名前付きコレクションで使います（例えば、名前キー付き辞書）。

source: The string value of the desired key.
ja: 望むキーの文字列値。

source: The subrange of the array to replace.
ja: 置き換えられることになる配列の下位範囲。

source: The subrange of the collection to replace.
ja: 置き換えることになるコレクションの下位範囲。

source: The subscript notation is preferred over prefix(through:).
ja: 添え字表記法は、prefix(through:)よりも好まれます。

source: The subscript notation is preferred over suffix(from:).
ja: 添え字表記法は、suffix(from:)よりも好まれます。

source: The subscript notation is preferred over prefix(upTo:).
ja: 添え字表記法は、prefix(upTo:)よりも好まれます。

source: The subtraction operator (-) calculates the difference of its two arguments.
ja: 減算演算子（-）は、それの２つの引数の差を計算します。

source: The successor of an index must be well defined.
ja: あるインデックスの後に続くものは、よく定義されなければなりません。

source: The sum of the two arguments must be representable in the arguments’ type.
ja: ２つの引数の合計は、引数の持つ型において表現可能でなければなりません。

source: The sum of types that can be used as a Quick Look representation.
ja: 「クイックルック」表現として使われることのできる型の総和。

source: The synthesized allCases collection provides the cases in order of their declaration.
ja: 合成されたallCasesコレクションは、ケース節をそれらの宣言の順に提供します。

source: The task continues executing when its executor is able to reschedule it.
ja: タスクは、それの遂行者（executor）がそれを予定変更可能である時に遂行を継続します。

source: The tasks are canceled only if cancelAll() was invoked before returning, if the group’s task was canceled, or if the group’s body throws an error.
ja: タスクそれらが取り消されるのは、復帰する前にcancelAll()が発動された場合にのみです、グループのもつタスクが取り消されたとしても、またはグループのもつ本体がエラーをスローするとしても。

source: The tasks are canceled only if cancelAll() was invoked before returning, if the group’s task was canceled.
ja: タスクそれらが取り消されるのは、復帰する前にcancelAll()が発動された場合にのみです、グループのもつタスクが取り消されたとしても。

source: The tasks must handle cancellation in some other way, such as returning the work completed so far, returning an empty result, or returning nil.
ja: タスクは取り消しを何らかの他の方法で取り扱わなければなりません、たとえばそれまでに完了された仕事を返す、空の結果を返す、またはnilを返すなど。

source: The textual representation for each item is the same as that obtained by calling String(item).
ja: 各項目のテキスト表現は、String(item)を呼び出すことで得られるものと同じです。

source: The textual representation for each item is the same as that obtained by calling String(reflecting: item).
ja: 各項目のテキスト表現は、String(reflecting: item)を呼び出すことで得られるものと同じです。

source: The total number of elements that the array can contain without allocating new storage.
ja: その配列が新しいストレージを割り当てることなく含むことができる要素の総数。

source: The total number of key-value pairs that the dictionary can contain without allocating new storage.
ja: その辞書が新しいストレージをアロケートすることなく含むことが可能なキー値ペアの総数。

source: The transforming closure takes the received Int and returns a new Counter that counts that high.
ja: 変換クロージャは、その受け取ったIntをとり、そしてその高さを数える新しいCounterを返します。

source: The two arguments must have the same Element type.
ja: ２つの引数は、同じElement型を持たなければなりません。

source: The two arguments must not alias each other.
ja: ２つの値は、互いのエイリアスであってはいけません。

source: The two loops in the following example produce the same output:
ja: 以下の例における２つのループは、同じ出力を生み出します：

source: The type T to which x is cast.
ja: 型T、それへとxがキャストされます。

source: The type aliased by BooleanLiteralType must conform to the ExpressibleByBooleanLiteral protocol.
ja: BooleanLiteralTypeによってエイリアス（別名）を付けられる型は、ExpressibleByBooleanLiteralプロトコルに準拠しなければなりません。

source: The type doesn't meet the criteria listed in the previous section.
ja: その型が以前の節においてリストされる基準に合わない。

source: The type each segment of a string literal containing interpolations should be appended to.
ja: 加えられるべき補間を含んでいる文字列リテラルの各文節の型。

source: The type of asynchronous iterator that produces elements of this asynchronous sequence.
ja: この非同期シーケンスの要素それらを取り出す非同期イテレータの型。

source: The type of element produced by this asynchronous sequence.
ja: この非同期シーケンスによって取り出される要素の型。

source: The type of element returned by next().
ja: next()によって返される要素のもつ型。

source: The type of element traversed by the iterator.
ja: このイテレータによって辿っていかれる要素の型。

source: The type of elements produced by this iterator.
ja: このイテレータによって取り出される要素それらの型。

source: The type of iterator that produces elements of the sequence.
ja: このシーケンスの要素それらを生み出すイテレータの型。

source: The type of scalars in the vector space.
ja: このベクタースペースの中のスカラーそれらの型。

source: The type of the elements of an array literal.
ja: 配列リテラルの要素の型。

source: The type of the shared actor instance that will be used to provide mutually-exclusive access to declarations annotated with the given global actor type.
ja: 共有アクターインスタンスの型、それは与えられたグローバルアクター型で注釈を付けられた宣言への相互排他アクセスを提供するために使われます。

source: The type that allows iteration over an array’s elements.
ja: 配列の持つ要素のすべてにわたる反復を許可する型。

source: The type that represents the indices that are valid for subscripting an array, in ascending order.
ja: 昇順での、配列の添え字として有効なインデックスを表す型。

source: The type that should be used for literal segments.
ja: リテラル文節に対して使われるべき型。

source: The type the AsyncStream will produce.
ja: AsyncStreamが生み出すだろう型。

source: The type to cast x to.
ja: xをこれにキャストすることになる型。

source: The typed pointer to convert.
ja: 変換されることになる型付ポインタ。

source: The types of the two underlying indices must be identical.
ja: ２つの基礎をなすインデックスの型は同一でなければなりません。

source: The unary minus operator (prefix -) calculates the negation of its operand.
ja: 単項マイナス演算子（前置-）は、それの演算数の否定を計算します。

source: The underlying error which caused this error, if any.
ja: このエラーの元となった基礎をなすエラー、もしあれば。

source: The underlying iterator’s sequence may be infinite.
ja: 基礎をなすイテレータのもつシーケンスは、無限であるかもしれません。

source: The underlying type a Boolean uses when it wraps itself in a data value.
ja: あるブールが、それがそれ自身をあるデータ値の中にラップする時に使う、基礎をなす型。

source: The underlying type a dictionary uses when it wraps itself in a data value.
ja: ある辞書が、それがそれ自身をあるデータ値の中にラップする時に使う、基礎をなす型。

source: The underlying type a double uses when it wraps itself in a data value.
ja: あるdoubleが、それがそれ自身をあるデータ値の中にラップする時に使う、基礎をなす型。

source: The underlying type an array uses when it wraps itself in a data value.
ja: ある配列が、それがそれ自身をあるデータ値の中にラップする時に使う、基礎をなす型。

source: The underlying type an integer uses when it wraps itself in a data value.
ja: 整数が、それがそれ自身をあるデータ値の中にラップする時に使う、基礎をなす型。

source: The unit in the last place of 1.0.
ja: 1.0の最終桁単位。

source: The unit in the last place of this value.
ja: この値の最終桁単位。

source: The universal hash function used by Set and Dictionary.
ja: SetとDictionaryによって使われる普遍的なハッシュ関数。

source: The upper bound for the range.
ja: 範囲の上側の境界。

source: The value associated with key if key is in the dictionary; otherwise, nil.
ja: keyと結び付けられた値、keyが辞書の中にあるならば；そうでなければ、nil。

source: The value associated with key in the dictionary; otherwise, defaultValue.
ja: keyと辞書の中で結びつけられる値；そうでなければdefaultValue。

source: The value for which to find the dynamic type.
ja: それに対して動的型を見つける値。

source: The value of count must be greater than or equal to zero.
ja: countの値は、ゼロより大きいか等しくなければなりません。

source: The value of maxLength must be greater than or equal to zero.
ja: maxLengthの値は、ゼロより大きいか等しくなければなりません。

source: The value of other is represented exactly by the new instance.
ja: otherの値は、新しいインスタンスによって正確に表されます。

source: The value of other is rounded to a representable value, if necessary.
ja: otherの値は、必要ならば、表現可能な値へと丸められます。

source: The value of value is rounded to a representable value, if necessary.
ja: valueの値は、必要ならば、表現可能な値へと丸められます。

source: The value of x converted to type U.
ja: 型Uに変換されたxの値。

source: The value of significandWidth is always -1 or between zero and significandBitCount.
ja: significandWidthの値は、常に-1、もしくはゼロとsignificandBitCountの間です。

source: The value of the key.
ja: キーの値。

source: The value of the new instance.
ja: 新しいインスタンスのための値。

source: The value of this property must always evaluate to the same actor instance.
ja: このプロパティの値は、同じアクターインスタンスと常に等しくなければなりません。

source: The value of this property must be equivalent to shared.unownedExecutor.
ja: このプロパティの値は、shared.unownedExecutorと等しくなければなりません。

source: The value passed as bitPattern is interpreted in the binary interchange format defined by the IEEE 754 specification.
ja: bitPatternとして渡される値は、IEEE 754仕様で定義されるバイナリ交換フォーマットにおいて解釈されます。

source: The value passed as distance must not offset i beyond the bounds of the collection, unless the index passed as limit prevents offsetting beyond those bounds.
ja: distanceとして渡される値は、このコレクションの境界を越えてiを補ってはなりません、limitとして渡されるインデックスがそれら境界を越えて補うのを防止するのでない限りは。

source: The value passed as distance must not offset i beyond the bounds of the collection.
ja: distanceとして渡される値は、このコレクションの境界を越えてiを補ってはなりません。

source: The value passed as n must not offset i beyond the bounds of the collection, unless the index passed as limit prevents offsetting beyond those bounds.
ja: nとして渡される値は、このコレクションの境界を越えてiを補ってはなりません、limitとして渡されるインデックスがそれら境界を越えて補うのを防止するのでない限りは。

source: The value passed as n must not offset i beyond the bounds of the collection.
ja: nとして渡される値は、このコレクションの境界を越えてiを補ってはなりません。

source: The value passed as source must be representable in this type.
ja: sourceとして渡される値は、この型において表現可能でなければなりません。

source: The value passed to the continuation by the closure.
ja: クロージャによって継続へと渡される値。

source: The value that was removed, or nil if the key was not present in the dictionary.
ja: 削除された値、またはキーがこの辞書の中に存在しなかったならばnil。

source: The value that was replaced, or nil if a new key-value pair was added.
ja: 取って代わられた値、または新しいキー値ペアが加えられたならばnil。

source: The value to add to this value.
ja: この値に加える値。

source: The value to calculate the distance to.
ja: それへの隔たりを計算される値。

source: The value to compare with this value.
ja: この値と比較するための値。

source: The value to create.
ja: 作成されることになる値。

source: The value to divide lhs by.
ja: この値でlhsを除算します。

source: The value to divide this value by.
ja: この値を除算するための値。

source: The value to divide.
ja: 除算することになる値。

source: The value to multiply by this value.
ja: この値と掛け合わせられることになる値。

source: The value to multiply this value by.
ja: この値に掛ける値。

source: The value to negate.
ja: 負にする値。

source: The value to output to the target stream.
ja: targetストリームに出力することになる値。

source: The value to return from the continuation.
ja: その継続から返す値。

source: The value to shift.
ja: シフトする値。

source: The value to subtract from lhs.
ja: lhsから減じる値。

source: The value to subtract from this value.
ja: この値から減じる値。

source: The value to test.
ja: テストする値。

source: The value to use as the initial accumulating value.
ja: 最初から蓄積されている値として使われる値。

source: The value to use for the new instance.
ja: 新しいインスタンスのために使う値。

source: The value to use in an integer-indexed collection (e.g. an int-keyed dictionary).
ja: 整数インデックスのコレクション（例えば、intキー付き辞書）において使うための値。

source: The value to use when dividing this value.
ja: この値を除算するときに使うための値。

source: The value to yield from the continuation.
ja: その継続から生み出す値。

source: The value type for this key path.
ja: このキーパスのための値型。

source: The value type of a dictionary literal.
ja: 辞書リテラルの値型。

source: The value types in the table below have the same functionality as their corresponding reference types.
ja: 下の表の値型は、それらの対応する参照型と同じ機能性を持ちます。

source: The value wrapped by this instance.
ja: このインスタンスによってラップされる値。

source: The value you pass as end is not guaranteed to be included in the sequence.
ja: あなたがendとして渡す値は、シーケンスに含まれることを保証されません。

source: The values passed as exponentBitPattern and significandBitPattern are interpreted in the binary interchange format defined by the IEEE 754 specification.
ja: exponentBitPatternとsignificandBitPatternに渡される値は、IEEE 754 specificationで定義されるバイナリ交換フォーマットにおいて解釈されます。

source: The way these scalar values are grouped is defined by a canonical, localized, or otherwise tailored Unicode segmentation algorithm.
ja: これらのスカラー値が一群にされる方法は、ある正準の、ローカライズされた、ないしは別の方法で仕立てられたユニコード分節アルゴリズムによって定義されます。

source: The work associated with yielding values to the AsyncStream.
ja: AsyncStreamへと生み出している値と結びつけられた仕事。

source: The zero value.
ja: ゼロ値。

source: The “past the end” index of the resulting subsequence.
ja: 結果のシーケンスの「終わりを過ぎた」インデックス。

source: The “past the end” position—that is, the position one greater than the last valid subscript argument.
ja: 「終わりを過ぎた」位置—すなわち、最後の有効な添え字引数より１つ大きい位置。

source: There are some edge cases to be aware of:
ja: 知られているいくつかの境界事例があります：

source: There are two categories of methods: those that return a single value, and those that return another AsyncSequence.
ja: ２つのカテゴリのメソッドがあります：ある単一の値を返すもの、そして別のAsyncSequenceを返すもの。

source: There may be smaller positive numbers, but they are subnormal, meaning that they are represented with less precision than normal numbers.
ja: より小さい正の数があるでしょう、しかしそれらはサブノーマルであり、それらがノーマル数よりより少ない精密さで表現されることを意味しています。

source: Therefore, x.binade is equal to 1.0 * 2**4, or 16.0.
ja: それゆえに、x.binadeは1.0 * 2**4、または16.0と等しいです。

source: Therefore, a ClosedRange instance cannot represent an empty range.
ja: それゆえに、ClosedRangeインスタンスは空の範囲として表すことができません。

source: Therefore, you must only call this function from mutating methods with appropriate thread synchronization.
ja: したがって、あなたはこの関数を変更メソッドから適切なスレッド同期で呼ぶだけにしてください。

source: These accesses may be merged, eliminated, and rearranged with other work, and they may even be introduced when not strictly required.
ja: これらのアクセスは、他の仕事によって合併、排除、そして再配列されるかもしれません、そしてそれらは厳密には必要とされない時に始められさえするかもしれません。

source: These code points are combined by Unicode’s boundary algorithms into extended grapheme clusters.
ja: これらのコード点は、ユニコードの境界アルゴリズムによって拡張書記素クラスタへと組み合わされます。

source: These counters can be used as indices only in instances of zero-based, integer-indexed collections, such as Array and ContiguousArray.
ja: これらのカウンタはインデックスとして使われることが、ゼロ基盤の、整数インデックスでのコレクション、例えばArrayそしてContiguousArrayなどのインスタンスにおいてのみ可能です。

source: These initializers create an integer with the bit pattern of the memory address of a pointer or class instance.
ja: これらのイニシャライザは、あるポインタまたはクラスインスタンスのメモリアドレスのビットパターンで整数を作成します。

source: These initializers result in nil if the value passed can't be represented without any loss of precision.
ja: これらのイニシャライザは、渡された値が何ら精度の損失なしに表現できないならばnilという結果になります。

source: These initializers result in nil if the value passed can’t be represented without any loss of precision.
ja: これらのイニシャライザは、渡された値が何ら精度の損失なしに表現できないならばnilという結果になります。

source: These methods return the result of an operation, and a flag indicating whether the operation overflowed the bounds of the type.
ja: これらのメソッドは演算の結果、そしてその演算がその型の境界をオーバーフローしたかどうかを示すフラグを返します。

source: These properties are the same ones used to test for equality in the == operator function.
ja: これらプロパティは、==演算子関数において同等性についてテストするために使われるのと同じものです。

source: These returned sequences don’t eagerly await the next member of the sequence, which allows the caller to decide when to start work.
ja: それら返されるシーケンスは、そのシーケンスの次のメンバーを熱心には待ちません、それは呼び出し側にいつ仕事を開始するのか決定するのを許可します。

source: These two operations impose a strict total order on the values of a type, in which exactly one of the following must be true for any two values a and b:
ja: これら２つの演算子は、ある型の値に全順序を課します、そこにおいて任意の２つの値aとbに対して、厳密に以下のうちの１つが真でなければなりません：

source: These types and protocols drop their NS prefix, with the following exceptions:
ja: これら型およびプロトコルは、それらのNS接頭辞を外します、以下の例外を除いては：

source: This key-based subscript returns the value for the given key if the key is found in the dictionary, or nil if the key is not found.
ja: このキー基盤の添え字は、そのキーが辞書において見つけられるならば指定されたキーに対する値を、またはキーが見つからないならばnilを返します。

source: This associated type appears as a requirement in the Sequence protocol, but it is restated here with stricter constraints.
ja: この関連型は、Sequenceプロトコルの中のある要件として現れます、しかしここでより厳格な制約で言い直されます。

source: This avoids over-allocation, but can result in insertion not having amortized constant-time performance.
ja: これは過度のアロケーションを防ぎます、しかし挿入においてならし定数時間性能を持たない結果になります。

source: This can be called more than once and returns to the caller immediately without blocking for any awaiting consumption from the iteration.
ja: これは一回以上呼び出されることが可能です、そして呼び出し側にすぐに復帰します、その反復からの何らかの待ち受けている消費ために遮断することなく。

source: This can be called more than once and returns to the caller immediately without blocking for any awaiting consuption from the iteration.
ja: これは一回以上呼び出されることが可能です、そして呼び出し側にすぐに復帰します、その反復からの何らかの待ち受けている消費ために遮断することなく。

source: This capability, as well as the ability to store values in a set or use them as keys in a dictionary, are governed by two related standard library protocols, Equatable and Hashable.
ja: これができる力、それだけでなくいくらかの値を集合の中に格納するまたはそれらを辞書においてキーとして使う能力は、２つの関連する標準ライブラリプロトコル、EquatableとHashableによって管理されます。

source: This chapter describes the global functions defined in the Swift standard library.
ja: この章は、Swift標準ライブラリにおいて定義されるグローバル関数を記述します。

source: This contrasts with Array, which can store its elements in either a contiguous region of memory or an NSArray instance if its Element type is a class or @objc protocol.
ja: これはArrayとは対照的です、それはそれの要素をメモリの隣接領域かもしくは、それのElement型がクラスまたは@objcプロトコルならばNSArrayインスタンスのどちらかに格納することができます。

source: This differs from the operation cooperatively checking for cancellation and reacting to it in that the cancellation handler is always and immediately invoked when the task is canceled.
ja: これは、協力して取り消しを調べるそしてそれに反応する演算とは異なります、タスクが取り消される時にある取り消しハンドラが常にそして直ぐに発動される点において。

source: This documentation comment was inherited from AdditiveArithmetic.
ja: この文書化コメントは、AdditiveArithmeticから引き継がれました。

source: This documentation comment was inherited from AsyncIteratorProtocol.
ja: この文書化コメントは、AsyncIteratorProtocolから引き継がれました。

source: This documentation comment was inherited from AsyncSequence.
ja: この文書化コメントは、AsyncSequenceから引き継がれました。

source: This documentation comment was inherited from BidirectionalCollection.
ja: この文書化コメントは、BidirectionalCollectionから引き継がれました。

source: This documentation comment was inherited from BinaryFloatingPoint.
ja: この文書化コメントは、BinaryFloatingPointから引き継がれました。

source: This documentation comment was inherited from BinaryInteger.
ja: この文書化コメントは、BinaryIntegerから引き継がれました。

source: This documentation comment was inherited from Collection.
ja: この文書化コメントは、Collectionから引き継がれました。

source: This documentation comment was inherited from Comparable.
ja: この文書化コメントは、Comparableから引き継がれました。

source: This documentation comment was inherited from CustomDebugStringConvertible.
ja: この文書化コメントは、CustomDebugStringConvertibleから引き継がれました。

source: This documentation comment was inherited from CustomReflectable.
ja: この文書化コメントは、CustomReflectableから引き継がれました。

source: This documentation comment was inherited from CustomStringConvertible.
ja: この文書化コメントは、CustomStringConvertibleから引き継がれました。

source: This documentation comment was inherited from Decodable.
ja: この文書化コメントは、Decodableから引き継がれました。

source: This documentation comment was inherited from Encodable.
ja: この文書化コメントは、Encodableから引き継がれました。

source: This documentation comment was inherited from Equatable.
ja: この文書化コメントは、Equatableから引き継がれました。

source: This documentation comment was inherited from ExpressibleByArrayLiteral.
ja: この文書化コメントは、ExpressibleByArrayLiteralから引き継がれました。

source: This documentation comment was inherited from ExpressibleByBooleanLiteral.
ja: この文書化コメントは、ExpressibleByBooleanLiteralから引き継がれました。

source: This documentation comment was inherited from ExpressibleByExtendedGraphemeClusterLiteral.
ja: この文書化コメントは、ExpressibleByExtendedGraphemeClusterLiteralから引き継がれました。

source: This documentation comment was inherited from ExpressibleByFloatLiteral.
ja: この文書化コメントは、ExpressibleByFloatLiteralから引き継がれました。

source: This documentation comment was inherited from ExpressibleByIntegerLiteral.
ja: この文書化コメントは、ExpressibleByIntegerLiteralから引き継がれました。

source: This documentation comment was inherited from ExpressibleByUnicodeScalarLiteral.
ja: この文書化コメントは、ExpressibleByUnicodeScalarLiteralから引き継がれました。

source: This documentation comment was inherited from FixedWidthInteger.
ja: この文書化コメントは、FixedWidthIntegerから引き継がれました。

source: This documentation comment was inherited from FloatingPoint.
ja: この文書化コメントは、FloatingPointから引き継がれました。

source: This documentation comment was inherited from GlobalActor.
ja: この文書化コメントは、GlobalActorから引き継がれました。

source: This documentation comment was inherited from Hashable.
ja: この文書化コメントは、Hashableから引き継がれました。

source: This documentation comment was inherited from Identifiable.
ja: この文書化コメントは、Identifiableから引き継がれました。

source: This documentation comment was inherited from IteratorProtocol.
ja: この文書化コメントは、IteratorProtocolから引き継がれました。

source: This documentation comment was inherited from MutableCollection.
ja: この文書化コメントは、MutableCollectionから引き継がれました。

source: This documentation comment was inherited from Numeric.
ja: この文書化コメントは、Numericから引き継がれました。

source: This documentation comment was inherited from RandomAccessCollection.
ja: この文書化コメントは、RandomAccessCollectionから引き継がれました。

source: This documentation comment was inherited from RangeExpression.
ja: この文書化コメントは、RangeExpressionから引き継がれました。

source: This documentation comment was inherited from RawRepresentable.
ja: この文書化コメントは、RawRepresentableから引き継がれました。

source: This documentation comment was inherited from SIMDStorage.
ja: この文書化コメントは、SIMDStorageから引き継がれました。

source: This documentation comment was inherited from Sequence.
ja: この文書化コメントは、Sequenceから引き継がれました。

source: This documentation comment was inherited from Strideable.
ja: この文書化コメントは、Strideableから引き継がれました。

source: This documentation comment was inherited from StringInterpolationProtocol.
ja: この文書化コメントは、StringInterpolationProtocolから引き継がれました。

source: This documentation comment was inherited from TextOutputStream.
ja: この文書化コメントは、TextOutputStreamから引き継がれました。

source: This documentation comment was inherited from TextOutputStreamable.
ja: この文書化コメントは、TextOutputStreamableから引き継がれました。

source: This documentation contains preliminary information about an API or technology in development.
ja: この文書は、開発でのテクノロジーまたはAPIのための事前の情報を含んでいます。

source: This enforces keeping the specified amount of newest values.
ja: これは、指定量の最新の値それらを保つことを強要します。

source: This enforces keeping the specified amount of oldest values.
ja: これは、指定量の最古の値それらを保つことを強要します。

source: This error is also thrown automatically by Task.checkCancellation(), if the current task has been cancelled.
ja: このエラーはまた自動的にTask.checkCancellation()によってスローされます、もし現在のタスクがキャンセルされたならば。

source: This example appends the elements of a Range<Int> instance to an array of integers.
ja: この例は、Range<Int>インスタンスの要素を整数からなる配列に加えます。

source: This example checks to see whether a favorite actor is in an array storing a movie’s cast.
ja: この例は、映画出演者を格納する配列の中にお気に入りの俳優がいるかどうか確認するために調べます。

source: This example creates a ClosedRange<Character> from “a” up to, and including, “z”.
ja: この例は、「a」から「z」までの、そしてそれを含むClosedRange<Character>を作成します。

source: This example creates a PartialRangeFrom<Double> instance that includes any value greater than or equal to 5.0.
ja: この例は、PartialRangeFrom<Double>インスタンスで5.0より大きいか等しい何らかの値を含むものを作成します。

source: This example creates a PartialRangeThrough<Double> instance that includes any value less than or equal to 5.0.
ja: この例は、PartialRangeThrough<Double>インスタンスで5.0より少ないか等しい何らかの値を含むものを作成します。

source: This example creates a PartialRangeUpTo<Double> instance that includes any value less than 5.0.
ja: この例は、PartialRangeUpTo<Double>インスタンスで5.0より少ない何らかの値を含むものを作成します。

source: This example creates a Range<Double> from zero up to, but not including, 5.0.
ja: この例は、ゼロから5.0までの、しかしそれを含めないRange<Double>を作成します。

source: This example creates a key path from Array<Int> to String, and then tries appending compatible and incompatible key paths:
ja: この例は、Array<Int>からStringへのキーパスを作成して、それから互換および非互換のキーパスをくっつけることを試みます：
